src/InformationRegisters/БИТС_Результаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БИТС_Результаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>formattedText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>taskId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>commentId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/БИТС_Результаты/Ext/RecordSetModule.bsl
Процедура Обновить(РезультатыЗадач) Экспорт
	
	ЭтотОбъект.Прочитать();
	
	Для Каждого РезультатЗадачи Из РезультатыЗадач Цикл
		НоваяЗапись = ЭтотОбъект.Добавить();
		НоваяЗапись["id"]				= РезультатЗадачи["id"];
		НоваяЗапись["taskId"]			= РезультатЗадачи["taskId"];
		НоваяЗапись["commentId"]		= РезультатЗадачи["commentId"];
		НоваяЗапись["formattedText"]	= РезультатЗадачи["formattedText"];
		НоваяЗапись["text"]				= РезультатЗадачи["text"];
	КонецЦикла;
	
	ЭтотОбъект.Записать(Истина);
	
КонецПроцедуры
